app/controllers/messages_controller.rb

  def index
# binding.pry
    @receiver_user = User.friendly.find(params[:user_id])
# binding.pry
    # unless current_user.received_messages.where(sender: @receiver) &&
    #  @receiver.sent_messages.where(receiver: current_user)

    # @messages = current_user.received_messages.where(sender_id: @receiver.id) +
    #             @receiver_user.received_messages.where(sender_id: current_user.id)
# binding.pry
@messages = []
    # unless current_user.sent_messages
      @messages += current_user.sent_messages.where(receiver: @receiver_user)#.to_ary
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "messages".* FROM "messages" WHERE "messages"."receiver_id" = ? AND "messages"."receiver_id" = ?  [["receiver_id", 91], ["receiver_id", 241]]

  def create
   # binding.pry
    @message = Message.new(message_params)
    # # @message.receiver_id = params[:receiver_id]
    # @message.sender_id = current_user.id
    @message.save
---
INSERT INTO "messages" ("body", "receiver_id", "sender_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hello world"], ["receiver_id", 91], ["sender_id", 241], ["created_at", "2016-07-19 20:17:57.122804"], ["updated_at", "2016-07-19 20:17:57.122804"]]