app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all.page(params[:page]).per(10)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 245]]
---
  def show
    # binding.pry
    @user = User.friendly.find(params[:id])