app/controllers/welcome_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all.page(params[:page]).per(10).padding(1)